# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'nicoverbruggen/homebrew-cask'

# Binaries
brew 'tree'
brew 'htop'
brew 'nano'
brew 'bash' # Latest Bash version
brew 'coreutils' # Those that come with macOS are outdated
brew 'ffmpeg'
brew 'git'
brew 'grep'
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20

# Utils
brew 'imagemagick'
cask 'shottr'
brew 'watch'

# Development
cask 'pycharm'
brew 'nginx'
brew 'node'
brew 'micro'
cask 'docker'
cask 'kitty'

# Rice
cask 'hiddenbar'
cask 'stats'
cask 'topnotch'

# Automation
cask 'alt-tab'
cask 'karabiner-elements'
cask 'amethyst'

# Apps
cask 'google-chrome'
cask 'vlc'
